Revit 2016 API
CurveElement.CurveElementType Property
The curve element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public CurveElementType CurveElementType { get; }
Visual Basic
Public ReadOnly Property CurveElementType As CurveElementType
	Get
Visual C++
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
See Also
CurveElement Class
Autodesk.Revit.DB Namespace